---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures
source: html/ef87224e-09b6-8d07-3b24-3a3b322a9ae5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures

Failures related to rebar systems.

## Syntax (C#)
```csharp
public static class RebarSystemFailures
```